## Staging: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 1 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                             NAME                                              |
|----------|-----------------------------------------------------------------------------------------------|
| update   | `aws_iam_policy.pinpoint_logs`                                                                |
| recreate | `aws_cloudwatch_dashboard.pinpoint[0]`                                                        |
|          | `aws_cloudwatch_log_group.pinpoint_deliveries`                                                |
|          | `aws_cloudwatch_log_group.pinpoint_deliveries_failures`                                       |
|          | `aws_cloudwatch_log_metric_filter.pinpoint-sms-blocked-as-spam[0]`                            |
|          | `aws_cloudwatch_log_metric_filter.pinpoint-sms-failures[0]`                                   |
|          | `aws_cloudwatch_log_metric_filter.pinpoint-sms-phone-carrier-unavailable[0]`                  |
|          | `aws_cloudwatch_log_metric_filter.pinpoint-sms-rate-exceeded[0]`                              |
|          | `aws_cloudwatch_log_metric_filter.pinpoint-sms-successes[0]`                                  |
|          | `aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_ca_central_to_lambda[0]`          |
|          | `aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_failures_ca_central_to_lambda[0]` |
|          | `aws_lambda_permission.allow_cloudwatch_logs_pinpoint_failures[0]`                            |
|          | `aws_lambda_permission.allow_cloudwatch_logs_pinpoint_successes[0]`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.pinpoint_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pinpoint_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_dashboard.pinpoint[0] must be replaced
-/+ resource "aws_cloudwatch_dashboard" "pinpoint" {
      ~ dashboard_arn  = "arn:aws:cloudwatch::239043911459:dashboard/Pinpoint" -> (known after apply)
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (4 unchanged elements hidden)
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "AWS/SQS",
                                    "ApproximateNumberOfMessagesVisible",
                                    "QueueName",
                                    "eks-notification-canada-cadelivery-receipts",
                                ],
                            ]
                            period  = 60
                            region  = "ca-central-1"
                            stacked = false
                            stat    = "Average"
                            title   = "Number of messages visible in delivery-receipts"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 9
                        x          = 9
                        y          = 45
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics     = [
                              - [
                                  - "NotificationCanadaCa",
                                  - "staging_notifications_celery_clients_sns_request-time",
                                  - "metric_type",
                                  - "timing",
                                ],
                              + [
                                  + "NotificationCanadaCa",
                                  + "staging_notifications_celery_clients_pinpoint_request-time",
                                  + "metric_type",
                                  + "timing",
                                ],
                            ]
                          ~ title       = "TODO CONVERT TO PINPOINT p90 SNS request time in ms" -> "p90 Pinpoint request time in ms"
                            # (6 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              - [
                                  - "NotificationCanadaCa",
                                  - "staging_notifications_celery_tasks_process_sns_results",
                                  - "metric_type",
                                  - "counter",
                                ],
                              + [
                                  + "NotificationCanadaCa",
                                  + "staging_notifications_celery_tasks_process_pinpoint_results",
                                  + "metric_type",
                                  + "counter",
                                ],
                            ]
                          ~ title   = "Celery: Number of SNS delivery receipts processed" -> "Celery: Number of Pinpoint delivery receipts processed"
                            # (5 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ markdown = <<-EOT
                              - # Sending SMS with SNS
                              + # Sending SMS with Pinpoint
                            EOT
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 2
                        properties = {
                            markdown = <<-EOT
                                # Delivery receipts
                            EOT
                        }
                        type       = "text"
                        width      = 24
                        x          = 0
                        y          = 37
                    },
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "AWS/Lambda",
                                    "Invocations",
                                    "FunctionName",
                                    "pinpoint-to-sqs-sms-callbacks",
                                ],
                                [
                                    ".",
                                    "Errors",
                                    ".",
                                    ".",
                                    {
                                        color = "#d62728"
                                        yAxis = "right"
                                    },
                                ],
                            ]
                            period  = 300
                            region  = "ca-central-1"
                            stacked = true
                            stat    = "Sum"
                            title   = "Pinpoint Callback Lambda invocations per 5m"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 9
                        x          = 0
                        y          = 39
                    },
                  ~ {
                      ~ properties = {
                          ~ markdown = <<-EOT
                                ## Limits
                              - - SNS [maximum sending rate](https://docs.aws.amazon.com/general/latest/gr/sns.html#limits_sns): 20 SMS/second
                                - [Spending limit](https://ca-central-1.console.aws.amazon.com/sns/v3/home?region=ca-central-1#/mobile/text-messaging) of 30,000 USD/month
                                
                                ## Message flow
                              - After a notification has been created in the database, Celery sends the SMS to the provider using the `deliver_sms` Celery task. This Celery task is assigned to the SQS queue [eks-notification-canada-casend-sms-low](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-low), [eks-notification-canada-casend-sms-medium](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-medium), or [eks-notification-canada-casend-sms-high](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-high) depending on the SMS priority. This task calls the SNS API to send a text message.
                              + After a notification has been created in the database, Celery sends the SMS to the provider using the `deliver_sms` Celery task. This Celery task is assigned to the SQS queue [eks-notification-canada-casend-sms-low](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-low), [eks-notification-canada-casend-sms-medium](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-medium), or [eks-notification-canada-casend-sms-high](#/queues/https%3A%2F%2Fsqs.ca-central-1.amazonaws.com%2F239043911459%2Feks-notification-canada-casend-sms-high) depending on the SMS priority. This task calls the SNS pr Pinpoint API to send a text message.
                                
                              - ## SNS IDs
                              - SNS keeps track of SMS with a `messageId`, the value of SNS' `messageId` is stored in the `Notification` object in the `reference` column.
                              + ## SMS IDs
                              + AWS keeps track of SMS with a `messageId`, the value of SNS' `messageId` is stored in the `Notification` object in the `reference` column.
                                
                                ## Logging
                              - Celery tasks output multiple messages when processing tasks/calling the SNS API, take a look at the relevant Celery code to know more.
                              + Celery tasks output multiple messages when processing tasks/calling the SNS/Pinpoint API, take a look at the relevant Celery code to know more.
                                
                                After an SMS has been sent by SNS, the delivery details are stored in CloudWatch Log groups:
                                
                                - [sns/ca-central-1/239043911459/DirectPublishToPhoneNumber](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FDirectPublishToPhoneNumber) for successful deliveries
                                - [sns/ca-central-1/239043911459/DirectPublishToPhoneNumber/Failure](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FDirectPublishToPhoneNumber$252FFailure) for failures
                                
                                ## Phone numbers
                                
                              - SMS sent in `ca-central-1` use random phone numbers managed by AWS.
                              + SMS sent in `ca-central-1` use phone numbers reserved for Notify's use
                                
                                ### ⚠️  SNS in `us-west-2`
                                If a Notify service has an inbound number attached, SMS will be sent with SNS using a long code phone number ordered on Pinpoint in the `us-west-2` region. Statistics for this region and alarms are **not visible on this dashboard**.
                            EOT
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "NotificationCanadaCa",
                                    "staging_notifications_celery_tasks_deliver_sms",
                                    "metric_type",
                                    "counter",
                                ],
                            ]
                            period  = 300
                            region  = "ca-central-1"
                            stacked = true
                            stat    = "Sum"
                            title   = "Number of deliver_sms Celery tasks per 5m"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 9
                        x          = 9
                        y          = 17
                    },
                  ~ {
                      ~ properties = {
                          ~ markdown = <<-EOT
                                ## Message flow
                              - After an SMS has been sent by SNS, the delivery details are stored in CloudWatch Log groups:
                              + After an SMS has been sent by Pinpoint, the delivery details are stored in CloudWatch Log groups:
                                
                              - - [sns/ca-central-1/239043911459/DirectPublishToPhoneNumber](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FDirectPublishToPhoneNumber) for successful deliveries
                              - - [sns/ca-central-1/239043911459/DirectPublishToPhoneNumber/Failure](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FDirectPublishToPhoneNumber$252FFailure) for failures
                              + - [sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FPinpointDirectPublishToPhoneNumber) for successful deliveries
                              + - [sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure](#logsV2:log-groups/log-group/sns$252Fca-central-1$252F239043911459$252FPinpointDirectPublishToPhoneNumber$252FFailure) for failures
                                
                              - The log groups are subscribed the Lambda function [sns-to-sqs-sms-callbacks](#/functions/sns-to-sqs-sms-callbacks?tab=configuration). This Lambda adds messages to the SQS queue `delivery-receipts` to trigger the Celery task in charge of updating notifications in the database, `process-sns-result`.
                              + The log groups are subscribed the Lambda function [pinpoint-to-sqs-sms-callbacks](#/functions/pinpoint-to-sqs-sms-callbacks?tab=configuration). This Lambda adds messages to the SQS queue `delivery-receipts` to trigger the Celery task in charge of updating notifications in the database, `process-pinpoint-result`.
                                
                                See the relevant [AWS documentation](https://docs.aws.amazon.com/sns/latest/dg/sms_stats_cloudwatch.html#sns-viewing-cloudwatch-logs) for these messages.
                            EOT
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 3
                        properties = {
                            query   = <<-EOT
                                SOURCE 'sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure' | fields @timestamp as Timestamp, notification.messageId as MessageID, status, delivery.destination as Destination, delivery.providerResponse as ProviderResponse
                                | sort @timestamp desc
                                | limit 20
                            EOT
                            region  = "ca-central-1"
                            stacked = false
                            title   = "Pinpoint SMS Errors Log / ca-central-1"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 24
                        x          = 0
                        y          = 51
                    },
                  ~ {
                      ~ properties = {
                          ~ title                = "TODO: Convert to Pinpoint p90 SMS sending time in seconds" -> "SMS (SNS and Pinpoint) sending time in seconds"
                            # (12 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            query  = "SOURCE 'sns/ca-central-1/239043911459/DirectPublishToPhoneNumber/Failure' | SOURCE 'sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber' | stats avg(delivery.dwellTimeMsUntilDeviceAck / 1000 / 60) as Avg_carrier_time_minutes, count(*) as Number by delivery.phoneCarrier as Carrier"
                            region = "ca-central-1"
                            title  = "Carrier Dwell Times"
                            view   = "table"
                        }
                        type       = "log"
                        width      = 24
                        x          = 0
                        y          = 63
                    },
                    # (8 unchanged elements hidden)
                ]
            }
        )
      ~ dashboard_name = "Pinpoint" -> "SMS-Pinpoint" # forces replacement
      ~ id             = "Pinpoint" -> (known after apply)
    }

  # aws_cloudwatch_log_group.pinpoint_deliveries must be replaced
-/+ resource "aws_cloudwatch_log_group" "pinpoint_deliveries" {
      ~ arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber" -> (known after apply)
      ~ id                = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.pinpoint_deliveries_failures must be replaced
-/+ resource "aws_cloudwatch_log_group" "pinpoint_deliveries_failures" {
      ~ arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> (known after apply)
      ~ id                = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-blocked-as-spam[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-blocked-as-spam" {
      ~ id             = "pinpoint-sms-blocked-as-spam" -> (known after apply)
      ~ log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
        name           = "pinpoint-sms-blocked-as-spam"
        # (1 unchanged attribute hidden)

      ~ metric_transformation {
          - dimensions    = {} -> null
            name          = "pinpoint-sms-blocked-as-spam"
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-failures[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-failures" {
      ~ id             = "pinpoint-sms-failures" -> (known after apply)
      ~ log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
        name           = "pinpoint-sms-failures"
        # (1 unchanged attribute hidden)

      ~ metric_transformation {
          - dimensions    = {} -> null
            name          = "pinpoint-sms-failures"
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-phone-carrier-unavailable[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-phone-carrier-unavailable" {
      ~ id             = "pinpoint-sms-phone-carrier-unavailable" -> (known after apply)
      ~ log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
        name           = "pinpoint-sms-phone-carrier-unavailable"
        # (1 unchanged attribute hidden)

      ~ metric_transformation {
          - dimensions    = {} -> null
            name          = "pinpoint-sms-phone-carrier-unavailable"
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-rate-exceeded[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-rate-exceeded" {
      ~ id             = "pinpoint-sms-rate-exceeded" -> (known after apply)
      ~ log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
        name           = "pinpoint-sms-rate-exceeded"
        # (1 unchanged attribute hidden)

      ~ metric_transformation {
          - dimensions    = {} -> null
            name          = "pinpoint-sms-rate-exceeded"
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-successes[0] must be replaced
-/+ resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-successes" {
      ~ id             = "pinpoint-sms-successes" -> (known after apply)
      ~ log_group_name = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber" # forces replacement
        name           = "pinpoint-sms-successes"
        # (1 unchanged attribute hidden)

      ~ metric_transformation {
          - dimensions    = {} -> null
            name          = "pinpoint-sms-successes"
            # (4 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_ca_central_to_lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_ca_central_to_lambda" {
      ~ id              = "cwlsf-3414986778" -> (known after apply)
      ~ log_group_name  = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber" # forces replacement
        name            = "pinpoint_deliveries_ca_central"
      + role_arn        = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_failures_ca_central_to_lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_failures_ca_central_to_lambda" {
      ~ id              = "cwlsf-1494992571" -> (known after apply)
      ~ log_group_name  = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure" -> "sns/ca-central-1/239043911459/PinpointDirectPublishToPhoneNumber/Failure" # forces replacement
        name            = "pinpoint_deliveries_failures_ca_central"
      + role_arn        = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.pinpoint_logs will be updated in-place
  ~ resource "aws_iam_policy" "pinpoint_logs" {
        id               = "arn:aws:iam::239043911459:policy/PinpointLogsPolicy"
        name             = "PinpointLogsPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber:*",
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_failures[0] must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_failures" {
      ~ id                  = "terraform-20240422174859403300000002" -> (known after apply)
      ~ source_arn          = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure:*" # forces replacement -> (known after apply) # forces replacement
      ~ statement_id        = "terraform-20240422174859403300000002" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_successes[0] must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_successes" {
      ~ id                  = "terraform-20240422174859397100000001" -> (known after apply)
      ~ source_arn          = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber:*" # forces replacement -> (known after apply) # forces replacement
      ~ statement_id        = "terraform-20240422174859397100000001" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 12 to add, 1 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_to_sqs_sms_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.total-sms-spending-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pinpoint_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pinpoint_logs"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
